In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'C:\Users\Mohan shyam\Downloads\titanic_data.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [5]:
df.groupby(['Pclass'])

In [8]:
df.groupby(['Pclass'])["Sex"].sum()

Pclass
1    malefemalefemalemalefemalemalefemalefemalemale...
2    malemalemalefemalemalemalemalefemalemalefemale...
3    malefemalemalefemalemalefemalefemalemalemalema...
Name: Sex, dtype: object

In [9]:
df.groupby(['Pclass'])["Survived"].sum()

Pclass
1    50
2    30
3    72
Name: Survived, dtype: int64

In [10]:
df.groupby(['Pclass'])["Survived",'Sex'].sum()

C:\Users\MOHANS~1\AppData\Local\Temp/ipykernel_1320/3860824156.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['Pclass'])["Survived",'Sex'].sum()

        Survived
Pclass
1             50
2             30
3             72

In [13]:
df.groupby(['Pclass'])["Survived",'Embarked'].sum()

C:\Users\MOHANS~1\AppData\Local\Temp/ipykernel_1320/3802011015.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['Pclass'])["Survived",'Embarked'].sum()

        Survived
Pclass
1             50
2             30
3             72

In [14]:
df.groupby(['Pclass'])["Survived",'Age'].sum()

C:\Users\MOHANS~1\AppData\Local\Temp/ipykernel_1320/2979521066.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['Pclass'])["Survived",'Age'].sum()

        Survived      Age
Pclass
1             50  4010.00
2             30  2532.42
3             72  3508.08

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [22]:
total_survive=df["Survived"].sum()

In [23]:
df.shape

(418, 12)

In [24]:
total_unsurvive=418-total_survive

In [25]:
total_unsurvive

266

In [26]:
total_survive

152

In [33]:
percentage_of_survive=(total_survive/418)*100

In [34]:
percentage_of_survive

36.36363636363637

In [35]:
percentage_of_unsurvive=(total_unsurvive/418)*100

In [37]:
percentage_of_unsurvive

63.63636363636363

In [41]:
df.groupby(['Pclass'])[['Survived','Fare']].sum()

        Survived        Fare
Pclass
1             50  10087.9918
2             30   2064.7957
3             72   2703.7501

In [42]:
df.Fare.sum()

14856.5376

In [46]:
df.loc[df["Survived"]<1]['Fare'].sum()

7294.8874000000005

In [47]:
df.loc[df["Survived"]<1]['Pclass'].sum()

621